In [6]:
print("Wisdomic Panda")

Wisdomic Panda

In [2]:
import pandas as pd

In [ ]:
"""
Pandas: http://pandas.pydata.org/pandas-docs/stable/api.html
Credits: www.dataquest.io
Dataset is available at: https://www.kaggle.com/egrinstein/20-years-of-games
Data set is self-explainatory.
"""

In [5]:
pd.__version__

'0.22.0'

In [7]:
# read csv(comma separated values) into pandas dataframes.
data = pd.read_csv('ign.csv')

In [11]:
# get basic details : SIZE (rows, coulmns)
data.shape

(18625, 11)

In [150]:
type(countdata.shape)

tuple

In [15]:
# type of the columns
data.dtypes

Unnamed: 0          int64
score_phrase       object
title              object
url                object
platform           object
score             float64
genre              object
editors_choice     object
release_year        int64
release_month       int64
release_day         int64
dtype: object

In [16]:
# get all columns
data.columns

Index(['Unnamed: 0', 'score_phrase', 'title', 'url', 'platform', 'score',
       'genre', 'editors_choice', 'release_year', 'release_month',
       'release_day'],
      dtype='object')

In [17]:
# O means object:  type of variable as character
data['editors_choice'].dtypes

dtype('O')

In [18]:
# by default print FIRST/fetch 5 rows
data.head()

,Unnamed: 0,score_phrase,title,url,platform,score,genre,editors_choice,release_year,release_month,release_day
0,0,Amazing,LittleBigPlanet PS Vita,/games/littlebigplanet-vita/vita-98907,PlayStation Vita,9.0,Platformer,Y,2012,9,12
1,1,Amazing,LittleBigPlanet PS Vita -- Marvel Super Hero E...,/games/littlebigplanet-ps-vita-marvel-super-he...,PlayStation Vita,9.0,Platformer,Y,2012,9,12
2,2,Great,Splice: Tree of Life,/games/splice/ipad-141070,iPad,8.5,Puzzle,N,2012,9,12
3,3,Great,NHL 13,/games/nhl-13/xbox-360-128182,Xbox 360,8.5,Sports,N,2012,9,11
4,4,Great,NHL 13,/games/nhl-13/ps3-128181,PlayStation 3,8.5,Sports,N,2012,9,11

In [31]:
# by default LAST 5 rows # we are displaying only last 2

data.tail(2)

,Unnamed: 0,score_phrase,title,url,platform,score,genre,editors_choice,release_year,release_month,release_day
18623,18623,Masterpiece,Inside,/games/inside-playdead/xbox-one-121435,Xbox One,10.0,Adventure,Y,2016,6,28
18624,18624,Masterpiece,Inside,/games/inside-playdead/pc-20055740,PC,10.0,Adventure,Y,2016,6,28

In [25]:
# changing the datatype using astye()
data.release_month = data.release_month.astype(float)

In [26]:
# int changed to float 
data.release_month.dtypes

dtype('float64')

In [29]:
#result
data['release_month'][:5]

0    9.0
1    9.0
2    9.0
3    9.0
4    9.0
Name: release_month, dtype: float64

In [30]:
#changing back to int 
data.release_month = data.release_month.astype(int)

In [53]:
data[['release_day','release_month','release_year']][0:5]

   release_day  release_month  release_year
0           12              9          2012
1           12              9          2012
2           12              9          2012
3           11              9          2012
4           11              9          2012

In [37]:
# iloc method allows us to retrieve rows and columns by position
# iloc[startrow: endrow, startcolumn: endcoulmn]

data.iloc[0:3]

,Unnamed: 0,score_phrase,title,url,platform,score,genre,editors_choice,release_year,release_month,release_day
0,0,Amazing,LittleBigPlanet PS Vita,/games/littlebigplanet-vita/vita-98907,PlayStation Vita,9.0,Platformer,Y,2012,9,12
1,1,Amazing,LittleBigPlanet PS Vita -- Marvel Super Hero E...,/games/littlebigplanet-ps-vita-marvel-super-he...,PlayStation Vita,9.0,Platformer,Y,2012,9,12
2,2,Great,Splice: Tree of Life,/games/splice/ipad-141070,iPad,8.5,Puzzle,N,2012,9,12

In [35]:
# iloc[startrows:endrows,start_column_index:end_column_index]

data.iloc[100:104,1:4]

,score_phrase,title,url
100,Good,Doom 3: BFG Edition,/games/doom-3/pc-135338
101,Great,Dokuro,/games/dokuro/vita-130906
102,Painful,Naughty Bear: Panic in Paradise,/games/naughty-bear-panic-in-paradise/xbox-360...
103,Painful,Naughty Bear: Panic in Paradise,/games/naughty-bear-panic-in-paradise/ps3-135407

In [36]:
#  the 10th row, and all of the columns for that row

data.iloc[9,:]

Unnamed: 0                                                9
score_phrase                                           Good
title                             Total War Battles: Shogun
url               /games/total-war-battles-shogun/pc-142564
platform                                                 PC
score                                                     7
genre                                              Strategy
editors_choice                                            N
release_year                                           2012
release_month                                             9
release_day                                              11
Name: 9, dtype: object

In [40]:
# loc allows us to index using labels instead of positions
# in case of ioc[0:2]: the total row count is 2. ie row at index 0 and row at index 1.
# but loc gets rows at indices 0,1,2 means 3 rows!

data.loc[0:2]

,Unnamed: 0,score_phrase,title,url,platform,score,genre,editors_choice,release_year,release_month,release_day
0,0,Amazing,LittleBigPlanet PS Vita,/games/littlebigplanet-vita/vita-98907,PlayStation Vita,9.0,Platformer,Y,2012,9,12
1,1,Amazing,LittleBigPlanet PS Vita -- Marvel Super Hero E...,/games/littlebigplanet-ps-vita-marvel-super-he...,PlayStation Vita,9.0,Platformer,Y,2012,9,12
2,2,Great,Splice: Tree of Life,/games/splice/ipad-141070,iPad,8.5,Puzzle,N,2012,9,12

In [41]:
# 5 rows
data.loc[0:5,['title','score']]

                                               title  score
0                            LittleBigPlanet PS Vita    9.0
1  LittleBigPlanet PS Vita -- Marvel Super Hero E...    9.0
2                               Splice: Tree of Life    8.5
3                                             NHL 13    8.5
4                                             NHL 13    8.5
5                          Total War Battles: Shogun    7.0

In [51]:
# returns unique values from the column: data.title.unique -> to display
data.title.unique()

array(['LittleBigPlanet PS Vita',
       'LittleBigPlanet PS Vita -- Marvel Super Hero Edition',
       'Splice: Tree of Life', ..., 'Tokyo Mirage Sessions #FE',
       'LEGO Star Wars: The Force Awakens',
       'Star Ocean: Integrity and Faithlessness'], dtype=object)

In [45]:
# shape will get you the count
data.title.unique().shape

(12589,)

In [52]:
# number the unique values of a coulmn.
data.title.nunique()

12589

In [60]:
# Using set_index("column name") we can set the indices as that column
data.set_index("title",inplace = True)

In [61]:
data.head()[:3]

,Unnamed: 0,score_phrase,url,platform,score,genre,editors_choice,release_year,release_month,release_day
title,,,,,,,,,,
LittleBigPlanet PS Vita,0,Amazing,/games/littlebigplanet-vita/vita-98907,PlayStation Vita,9.0,Platformer,Y,2012,9,12
LittleBigPlanet PS Vita -- Marvel Super Hero Edition,1,Amazing,/games/littlebigplanet-ps-vita-marvel-super-he...,PlayStation Vita,9.0,Platformer,Y,2012,9,12
Splice: Tree of Life,2,Great,/games/splice/ipad-141070,iPad,8.5,Puzzle,N,2012,9,12

In [62]:
# Index column is now no more a column
# check title is now removed 
data.dtypes

Unnamed: 0          int64
score_phrase       object
url                object
platform           object
score             float64
genre              object
editors_choice     object
release_year        int64
release_month       int64
release_day         int64
dtype: object

In [67]:
# reset_index( ) tells us that one should use the by default indices.
data.reset_index(inplace=True)

In [71]:
data.iloc()[6:8]

,index,title,Unnamed: 0,score_phrase,url,platform,score,genre,editors_choice,release_year,release_month,release_day
6,6,Double Dragon: Neon,6,Awful,/games/double-dragon-neon/xbox-360-131320,Xbox 360,3.0,Fighting,N,2012,9,11
7,7,Guild Wars 2,7,Amazing,/games/guild-wars-2/pc-896298,PC,9.0,RPG,Y,2012,9,11

In [90]:
# To sort the data sort_values( )
# By default inplace = False and ascending = True.

data.sort_values("score",ascending = False,inplace = True)

In [92]:
#descending order
data['score'][:4]

18624    10.0
2616     10.0
3080     10.0
3079     10.0
Name: score, dtype: float64

In [93]:
data.head(2)

,index,title,Unnamed: 0,score_phrase,url,platform,score,genre,editors_choice,release_year,release_month,release_day
18624,18624,Inside,18624,Masterpiece,/games/inside-playdead/pc-20055740,PC,10.0,Adventure,Y,2016,6,28
2616,2616,Pokemon Silver Version,2616,Masterpiece,/games/pokemon-silver-version/gbc-16709,Game Boy Color,10.0,RPG,Y,2000,10,16

In [162]:
# describe( ) is used to find some statistics like mean,minimum, quartiles etc. for numeric variables.
#to find the total count, maximum occuring string and its frequency we write include = ['object']
data.describe(include=["object"])

,title,score_phrase,url,platform,genre,editors_choice
count,18625,18625,18625,18625,18589,18625
unique,12589,11,18577,59,112,2
top,Open Season,Great,/games/wallace-and-gromits-grand-adventures-ep...,PC,Action,N
freq,10,4773,2,3370,3797,15108

In [96]:

# Mean, median, maximum and minimum

data.release_day.min()

1

In [97]:
data.release_day.max()

31

In [152]:
data.count()

index                       18625
title                       18625
Unnamed: 0                  18625
score_phrase                18625
url                         18625
platform                    18625
score                       18625
genre                       18589
editors_choice              18625
release_year                18625
release_month               18625
release_day                 18625
release_day_Concat_score    18625
difference2                 18625
dtype: int64

In [98]:
#get mean of score column.
data.score.mean()

6.950459060402743

In [165]:
# creatingn new columns:

data["release_day_Concat_score"] = data.release_day+data.score

#Alternatively
data["difference2"] = data.eval("release_day - release_month")
data[['score', 'release_day', 'release_day','release_day_Concat_score','difference2']][0:5]

       score  release_day  release_day  release_day_Concat_score  difference2
18624   10.0           28           28                      38.0           22
2616    10.0           16           16                      26.0            6
3080    10.0           14           14                      24.0            9
3079    10.0           14           14                      24.0            9
18433   10.0           24           24                      34.0           16

In [129]:
# agg( ) function is used to find all the functions for a given variable.

# To group the data by a categorical variable we use groupby( )

# To get the minimum score given for each score phrase
data.groupby('score_phrase').score.min()

score_phrase
Amazing         9.0
Awful           3.0
Bad             4.0
Disaster        0.5
Good            7.0
Great           8.0
Masterpiece    10.0
Mediocre        5.0
Okay            6.0
Painful         2.0
Unbearable      1.0
Name: score, dtype: float64

In [130]:
## Very important
data.groupby('score_phrase').score.agg(["count","min","max","mean"])

              count   min   max       mean
score_phrase
Amazing        1804   9.0   9.9   9.176663
Awful           664   3.0   3.9   3.290211
Bad            1269   4.0   4.9   4.331600
Disaster          3   0.5   0.8   0.666667
Good           4741   7.0   7.9   7.369099
Great          4773   8.0   8.9   8.316510
Masterpiece      55  10.0  10.0  10.000000
Mediocre       1959   5.0   5.9   5.318530
Okay           2945   6.0   6.9   6.366553
Painful         340   2.0   2.9   2.267941
Unbearable       72   1.0   1.9   1.290278

In [171]:
# filtering

data_score_9 = data[data.score == 9.0]
# 917 records with score 9.0
data_score_9.shape

(917, 14)

In [175]:
#To filter the rows with score phrase as "Amazing" and score  > 9.5" all columns

data_query = data[(data.score_phrase == "Amazing") & (data.score > 9.5)]
data_query.iloc[:10]
data_query.shape

(100, 14)

In [176]:
#or usinf loc

data_query = data.loc[(data.score_phrase == "Amazing") & (data.score > 9.5),:]

In [153]:
# very important
data.groupby('score_phrase').count()

,index,title,Unnamed: 0,url,platform,score,genre,editors_choice,release_year,release_month,release_day,release_day_Concat_score,difference2
score_phrase,,,,,,,,,,,,,
Amazing,1804,1804,1804,1804,1804,1804,1803,1804,1804,1804,1804,1804,1804
Awful,664,664,664,664,664,664,662,664,664,664,664,664,664
Bad,1269,1269,1269,1269,1269,1269,1268,1269,1269,1269,1269,1269,1269
Disaster,3,3,3,3,3,3,3,3,3,3,3,3,3
Good,4741,4741,4741,4741,4741,4741,4725,4741,4741,4741,4741,4741,4741
Great,4773,4773,4773,4773,4773,4773,4765,4773,4773,4773,4773,4773,4773
Masterpiece,55,55,55,55,55,55,55,55,55,55,55,55,55
Mediocre,1959,1959,1959,1959,1959,1959,1957,1959,1959,1959,1959,1959,1959
Okay,2945,2945,2945,2945,2945,2945,2940,2945,2945,2945,2945,2945,2945
Painful,340,340,340,340,340,340,339,340,340,340,340,340,340
Unbearable,72,72,72,72,72,72,72,72,72,72,72,72,72

In [177]:
# Alternatively we can use query( ) function and write our filtering criteria:

data.query('score>9.0 & score < 9.4').shape

# store to some variable and use shape

(447, 14)

In [215]:
#  Boolean Indexing in Pandas
#  The comparison compares each value in a Series to a specified value, 
# then generate a Series full of Boolean values indicating the status of the comparison for each row

 

score_filter = data["score"] > 7

In [219]:
score_filter.iloc[1550:1561]

4898     True
17620    True
5376     True
17588    True
4847     True
4902     True
5146     True
4532     True
4936     True
17501    True
4924     True
Name: score, dtype: bool

In [225]:
# multiple filter 

xbox_one_filter = (data["score"] > 9.7) & (data["platform"] == "Xbox One")

filtered_reviews = data[xbox_one_filter]

filtered_reviews.head()

filtered_reviews.shape

(4, 14)

In [179]:
# create new data frame

temp = pd.DataFrame({
                    "A" : ["John","Mary","Julia","Kenny","Henry"], 
                    "B" : ["Libra","Capricorn","Aries","Scorpio","Aquarius"]
                    })

In [180]:
temp.head()

       A          B
0   John      Libra
1   Mary  Capricorn
2  Julia      Aries
3  Kenny    Scorpio
4  Henry   Aquarius

In [181]:
# to change column names
temp.columns = ['Name','Zodiac']

In [183]:
temp.columns

Index(['Name', 'Zodiac'], dtype='object')

In [185]:
temp.head()

    Name     Zodiac
0   John      Libra
1   Mary  Capricorn
2  Julia      Aries
3  Kenny    Scorpio
4  Henry   Aquarius

In [186]:
# Removing the columns and rows

# default: axis = 0 which means the operation should take place horizontally, row wise. 
#To remove a column we need to set axis = 1.

temp.head()

    Name     Zodiac
0   John      Libra
1   Mary  Capricorn
2  Julia      Aries
3  Kenny    Scorpio
4  Henry   Aquarius

In [187]:
# default axis is 0 means index wise delete row 1 and 2 
temp.drop([1,2])

    Name    Zodiac
0   John     Libra
3  Kenny   Scorpio
4  Henry  Aquarius

In [191]:

temp.drop("Name", axis=1)

      Zodiac
0      Libra
1  Capricorn
2      Aries
3    Scorpio
4   Aquarius

In [192]:
# to persist the data
temp1 = temp.drop("Name", axis=1)

In [193]:
temp1.head()

      Zodiac
0      Libra
1  Capricorn
2      Aries
3    Scorpio
4   Aquarius

In [214]:
# generates error
# you cannot delete the row by mentioning the entire column axis = 1. 
temp.drop(0, axis=1)

ValueError: labels [0] not contained in axis

In [194]:
'''
We create a new dataframe named 'crops' and 
to create a NaN value we use np.nan by importing numpy
'''
import numpy as np

In [199]:
mydata = {
          'Crop': ['Rice', 'Wheat', 'Barley', 'Maize'],
          'Yield': [1010, 1025.2, 1404.2, 1251.7],
          'cost' : [102, np.nan, 20, 68]
        }
crops = pd.DataFrame(mydata)
crops

     Crop   Yield   cost
0    Rice  1010.0  102.0
1   Wheat  1025.2    NaN
2  Barley  1404.2   20.0
3   Maize  1251.7   68.0

In [201]:
# returns back the array of values row wise
df_arr = crops.values

In [202]:
df_arr

array([['Rice', 1010.0, 102.0],
       ['Wheat', 1025.2, nan],
       ['Barley', 1404.2, 20.0],
       ['Maize', 1251.7, 68.0]], dtype=object)

In [200]:
# to check if column has a NaN value.
crops.isnull().values.any()

True

In [204]:
mydata = {
          'Crop': ['Rice', 'Wheat', 'Barley', 'Maize'],
          'Yield': [1010, 1025.2, np.nan, 1251.7],
          'cost' : [102, np.nan, 20, 68],
          'popularity':[np.nan, 99, np.nan, 91]
        }
food = pd.DataFrame(mydata)
food

     Crop   Yield   cost  popularity
0    Rice  1010.0  102.0         NaN
1   Wheat  1025.2    NaN        99.0
2  Barley     NaN   20.0         NaN
3   Maize  1251.7   68.0        91.0

In [205]:
# to identify which column has NaN values:

null_columns=food.columns[food.isnull().any()]

In [206]:
null_columns

Index(['Yield', 'cost', 'popularity'], dtype='object')

In [207]:
# count the null occurences
food [null_columns].isnull().sum()

Yield         1
cost          1
popularity    2
dtype: int64

In [212]:
food.cost.head()

0    102.0
1      NaN
2     20.0
3     68.0
Name: cost, dtype: float64

In [210]:
#Replaces all null values with x from cost column

food.cost.fillna(99.99)

0    102.00
1     99.99
2     20.00
3     68.00
Name: cost, dtype: float64

In [213]:
# fill all nan values with "DATA_IGNORE" in all coulmns
food.fillna("DATA_IGNORE")

     Crop        Yield         cost   popularity
0    Rice         1010          102  DATA_IGNORE
1   Wheat       1025.2  DATA_IGNORE           99
2  Barley  DATA_IGNORE           20  DATA_IGNORE
3   Maize       1251.7           68           91

In [226]:
#  to import only specified columns from a csv file + accessing remote data.

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv', usecols=['crim', 'medv'])

In [227]:
df.head()

      crim  medv
0  0.00632  24.0
1  0.02731  21.6
2  0.02729  34.7
3  0.03237  33.4
4  0.06905  36.2

In [228]:
#to convert a series of date-strings to a timeseries

ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [230]:
#  convert a numpy array to a dataframe of given shape
# Input
ser = pd.Series(np.random.randint(1, 10, 35))

df = pd.DataFrame(ser.values.reshape(7,5))

df

   0  1  2  3  4
0  6  4  7  6  6
1  8  2  8  7  8
2  8  6  7  8  1
3  3  3  2  9  5
4  8  2  5  6  3
5  2  1  9  6  4
6  2  2  8  6  7

In [235]:
# combine many series to form a dataframe

ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

# Solution 1
df = pd.concat([ser1, ser2], axis=1)
df

    0   1
0   a   0
1   b   1
2   c   2
3   e   3
4   d   4
5   f   5
6   g   6
7   h   7
8   i   8
9   j   9
10  k  10
11  l  11
12  m  12
13  n  13
14  o  14
15  p  15
16  q  16
17  r  17
18  s  18
19  t  19
20  u  20
21  v  21
22  w  22
23  x  23
24  y  24
25  z  25

In [233]:
# convert the index of a series into a column of a dataframe

mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)